In [49]:
import pandas as pd
import numpy as np

In [244]:
dataset = pd.read_csv("./data/train.csv")
predict = pd.read_csv('./data/test.csv')

In [245]:
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [246]:
cabin = []
for z in dataset['Cabin']:
    cabin.append([x for x in str(z)][0])

In [247]:
a = list(set(cabin))

In [248]:
diction = {}
for index,v in enumerate(a):
    diction[v] = index

In [249]:
diction

{'T': 0, 'A': 1, 'C': 2, 'E': 3, 'n': 4, 'D': 5, 'F': 6, 'B': 7, 'G': 8}

In [250]:
cb_encode=[]
for z in cabin:
    cb_encode.append(diction[z])

In [251]:
dataset_title = [i.split(',')[1].split('.')[0].strip() for i in dataset['Name']]
dataset['Title'] = pd.Series(dataset_title)
dataset['Title'] = dataset['Title'].replace(['Lady', 'the Countess', 'Countess', 'Capt', 'Col', 'Don', 'Dr', 'Major', 'Rev', 'Sir', 'Jonkheer', 'Dona', 'Ms', 'Mme', 'Mlle'], 'Rare')
dataset['FamilyS'] = dataset['SibSp'] + dataset['Parch'] + 1

In [252]:
dataset_title = [i.split(',')[1].split('.')[0].strip() for i in predict['Name']]
predict['Title'] = pd.Series(dataset_title)
predict['Title'] = predict['Title'].replace(['Lady', 'the Countess', 'Countess', 'Capt', 'Col', 'Don', 'Dr', 'Major', 'Rev', 'Sir', 'Jonkheer', 'Dona', 'Ms', 'Mme', 'Mlle'], 'Rare')
predict['FamilyS'] = predict['SibSp'] + predict['Parch'] + 1

In [253]:
def family(x):
    if x < 2:
        return 'Single'
    elif x == 2:
        return 'Couple'
    elif x <= 4:
        return 'InterM'
    else:
        return 'Large'

In [254]:
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Title,FamilyS
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Mr,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Mrs,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Miss,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Mrs,2
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Mr,1

In [255]:
dataset['FamilyS'] = dataset['FamilyS'].apply(family)
predict['FamilyS'] = predict['FamilyS'].apply(family)

In [256]:
dataset['Embarked'].fillna(dataset['Embarked'].mode()[0], inplace=True)
predict['Embarked'].fillna(predict['Embarked'].mode()[0], inplace=True)

In [257]:
dataset['Age'].fillna(dataset['Age'].median(), inplace=True)
predict['Age'].fillna(predict['Age'].median(), inplace=True)
predict['Fare'].fillna(predict['Fare'].median(), inplace=True)

In [238]:
fare = []
for i in dataset['Fare']:
    if(i < 200):
        fare.append(1)
    else:
        fare.append(0)

0.0

In [239]:
age = []
for i in dataset['Age']:
    if(i < 16):
        age.append(1)
    else:
        age.append(0)

In [207]:
# dataset = dataset.drop(['PassengerId', 'Cabin', 'Name', 'SibSp', 'Parch', 'Ticket'], axis=1)
# X_test_passengers = predict['PassengerId']
# X_test = predict.drop(['PassengerId', 'Cabin', 'Name', 'SibSp', 'Parch', 'Ticket'], axis=1)

In [240]:
dataset['Age_encode'] = age
dataset['cb_encode'] = cb_encode
dataset['fare_encode'] = fare

In [242]:
X_train = dataset.iloc[:, 1:11]
Y_train = dataset.iloc[:, 0]
X_test = X_test

In [243]:
X_train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN

In [212]:
categories = ['Sex','Embarked','Title','FamilyS','Age','Fare']

In [213]:
for i in categories:
    dfDummies = pd.get_dummies(X_train[i], prefix = 'ctg')
    X_train = pd.concat([X_train, dfDummies], axis=1, sort=False)

In [214]:
X_train.shape

(891, 360)

In [215]:
for i in categories:
    del X_train[i]

In [221]:
X_train.head()

,Pclass,Age_encode,cb_encode,fare_en,ctg_female,ctg_male,ctg_C,ctg_Q,ctg_S,ctg_Master,...,ctg_153.4625,ctg_164.8667,ctg_211.3375,ctg_211.5,ctg_221.7792,ctg_227.525,ctg_247.5208,ctg_262.375,ctg_263.0,ctg_512.3292
0,3,0,4,1,0,1,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0
1,1,0,2,1,1,0,1,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,3,0,4,1,1,0,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0
3,1,0,2,1,1,0,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0
4,3,0,4,1,0,1,0,0,1,0,...,0,0,0,0,0,0,0,0,0,0

In [217]:
from sklearn.model_selection import train_test_split

x_train, x_val, y_train, y_val = train_test_split(X_train, Y_train, test_size = 0.3)

In [218]:
import pandas as pd
from xgboost import XGBClassifier
from sklearn.metrics import accuracy_score

In [219]:
model = XGBClassifier()

# fit the model with the training data

In [220]:
model.fit(x_train,y_train)

ValueError: feature_names must be unique

In [200]:
# predict the target on the train dataset
predict_train = model.predict(x_val)

# Accuray Score on train dataset
accuracy_train = accuracy_score(y_val,predict_train)
accuracy_train

0.8470149253731343